{
  "Puzzles": [
    {
      "Q": "A man was walking in the rain. He was in the middle of nowhere. He had nothing and nowhere to hide. He came home all wet, but not a single hair on his head was wet. Why is that?",
      "A": "bald",
      "E": "The man was Bald!"
    },
    {
      "Q": "​You are on your way to visit your Grandma, who lives at the end of the valley. It's her birthday, and you want to give her the cakes you've made. Between your house and her house, you have to cross 7 bridges, and as it goes in the land of make believe, there is a troll under every bridge! Each troll, quite rightly, insists that you pay a troll toll. Before you can cross their bridge, you have to give them half of the cakes you are carrying, but as they are kind trolls, they each give you back a single cake. How many cakes do you have to leave home with to make sure that you arrive at Grandma's with exactly 2 cakes?",
      "A": "2",
      "E": "At each bridge you are required to give half of your cakes, and you receive one back. Which leaves you with 2 cakes after every bridge."
    },
    {
      "Q": "Handel has been killed and Beethoven is on the case. He has interviewed the four suspects and their statements are shown below. Each suspect has said two sentences. One sentence of each suspect is a lie and one sentence is the truth. Help Beethoven figure out who the killer is. \n\n Joplin: I did not kill Handel. Either Grieg is the killer or none of us is. \n\n Grieg: I did not kill Handel. Gershwin is the killer. \n\n Strauss: I did not kill Handel. \n\n Grieg is lying when he says Gershwin is the killer. \n\n  Gershwin: I did not kill Handel. If Joplin did not kill him, then Grieg did.",
      "A": "Strauss",
      "E": "You need to take turns assuming someone is the killer; that means everyone's second sentence is a lie. If Joplin was the killer, Grieg's lie mixed with Strauss' counteracts the other. If Grieg was the killer, Gershwin would need to be a killer too. If Gershwin was the killer, Grieg and Strauss counter each other again, but with Strauss, everything would fit."
    },
    {
      "Q": "A monk has a very specific ritual for climbing up the steps to the temple. First he climbs up to the middle step and meditates for 1 minute. Then he climbs up 8 steps and faces east until he hears a bird singing. Then he walks down 12 steps and picks up a pebble. He takes one step up and tosses the pebble over his left shoulder. Now, he walks up the remaining steps three at a time which only takes him 9 paces. How many steps are there?",
      "A": "49",
      "E": "Do the maths!"
    },
    {
      "Q": "One brick is one kilogram and half a brick heavy. What is the weight of one brick in kilogram?",
      "A": "2",
      "E": "Assuming x as the weight, x=1+(x/2)"
    }

  ]
}
